Bondzio/dots-on-a-map/sensornode/source/Micrium/bsp/renesas/ywireless-rx111/include/iodefine.rx111.h
#define	__IR( x )		ICU.IR[ IR ## x ].BIT.IR
#define	 _IR( x )		__IR( x )
#define	  IR( x , y )	_IR( _ ## x ## _ ## y )
#define	__DTCE( x )		ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define	 _DTCE( x )		__DTCE( x )
#define	  DTCE( x , y )	_DTCE( _ ## x ## _ ## y )
#define	__IEN( x )		ICU.IER[ IER ## x ].BIT.IEN ## x
#define	 _IEN( x )		__IEN( x )
#define	  IEN( x , y )	_IEN( _ ## x ## _ ## y )
#define	__IPR( x )		ICU.IPR[ IPR ## x ].BIT.IPR
#define	 _IPR( x )		__IPR( x )
#define	  IPR( x , y )	_IPR( _ ## x ## _ ## y )
#define	__VECT( x )		VECT ## x
#define	 _VECT( x )		__VECT( x )
#define	  VECT( x , y )	_VECT( _ ## x ## _ ## y )
#define	__MSTP( x )		MSTP ## x
#define	 _MSTP( x )		__MSTP( x )
#define	  MSTP( x )		_MSTP( _ ## x )

#define	BSC		(*(volatile struct st_bsc    __sfr __evenaccess *)0x81300)
#define	CAC		(*(volatile struct st_cac    __sfr __evenaccess *)0x8B000)
#define	CMT		(*(volatile struct st_cmt    __sfr __evenaccess *)0x88000)
#define	CMT0	(*(volatile struct st_cmt0   __sfr __evenaccess *)0x88002)
#define	CMT1	(*(volatile struct st_cmt0   __sfr __evenaccess *)0x88008)
#define	CRC		(*(volatile struct st_crc    __sfr __evenaccess *)0x88280)
#define	DA		(*(volatile struct st_da     __sfr __evenaccess *)0x880C0)
#define	DOC		(*(volatile struct st_doc    __sfr __evenaccess *)0x8B080)
#define	DTC		(*(volatile struct st_dtc    __sfr __evenaccess *)0x82400)
#define	ELC		(*(volatile struct st_elc    __sfr __evenaccess *)0x8B100)
#define	FLASH	(*(volatile struct st_flash  __sfr __evenaccess *)0x7FC090)
#define	ICU		(*(volatile struct st_icu    __sfr __evenaccess *)0x87000)
#define	IWDT	(*(volatile struct st_iwdt   __sfr __evenaccess *)0x88030)
#define	MPC		(*(volatile struct st_mpc    __sfr __evenaccess *)0x8C11F)
#define	MTU		(*(volatile struct st_mtu    __sfr __evenaccess *)0x8860A)
#define	MTU0	(*(volatile struct st_mtu0   __sfr __evenaccess *)0x88690)
#define	MTU1	(*(volatile struct st_mtu1   __sfr __evenaccess *)0x88690)
#define	MTU2	(*(volatile struct st_mtu2   __sfr __evenaccess *)0x88692)
#define	MTU3	(*(volatile struct st_mtu3   __sfr __evenaccess *)0x88600)
#define	MTU4	(*(volatile struct st_mtu4   __sfr __evenaccess *)0x88600)
#define	MTU5	(*(volatile struct st_mtu5   __sfr __evenaccess *)0x88694)
#define	POE		(*(volatile struct st_poe    __sfr __evenaccess *)0x88900)
#define	PORT	(*(volatile struct st_port   __sfr __evenaccess *)0x8C120)
#define	PORT0	(*(volatile struct st_port0  __sfr __evenaccess *)0x8C000)
#define	PORT1	(*(volatile struct st_port1  __sfr __evenaccess *)0x8C001)
#define	PORT2	(*(volatile struct st_port2  __sfr __evenaccess *)0x8C002)
#define	PORT3	(*(volatile struct st_port3  __sfr __evenaccess *)0x8C003)
#define	PORT4	(*(volatile struct st_port4  __sfr __evenaccess *)0x8C004)
#define	PORT5	(*(volatile struct st_port5  __sfr __evenaccess *)0x8C005)
#define	PORTA	(*(volatile struct st_porta  __sfr __evenaccess *)0x8C00A)
#define	PORTB	(*(volatile struct st_portb  __sfr __evenaccess *)0x8C00B)
#define	PORTC	(*(volatile struct st_portc  __sfr __evenaccess *)0x8C00C)
#define	PORTE	(*(volatile struct st_porte  __sfr __evenaccess *)0x8C00E)
#define	PORTH	(*(volatile struct st_porth  __sfr __evenaccess *)0x8C051)
#define	PORTJ	(*(volatile struct st_portj  __sfr __evenaccess *)0x8C012)
#define	RIIC0	(*(volatile struct st_riic   __sfr __evenaccess *)0x88300)
#define	RSPI0	(*(volatile struct st_rspi   __sfr __evenaccess *)0x88380)
#define	RTC		(*(volatile struct st_rtc    __sfr __evenaccess *)0x8C400)
#define	RTCB	(*(volatile struct st_rtcb   __sfr __evenaccess *)0x8C402)
#define	S12AD	(*(volatile struct st_s12ad  __sfr __evenaccess *)0x89000)
#define	SCI1	(*(volatile struct st_sci1   __sfr __evenaccess *)0x8A020)
#define	SCI5	(*(volatile struct st_sci1   __sfr __evenaccess *)0x8A0A0)
#define	SCI12	(*(volatile struct st_sci12  __sfr __evenaccess *)0x8B300)
#define	SMCI1	(*(volatile struct st_smci   __sfr __evenaccess *)0x8A020)
#define	SMCI5	(*(volatile struct st_smci   __sfr __evenaccess *)0x8A0A0)
#define	SMCI12	(*(volatile struct st_smci   __sfr __evenaccess *)0x8B300)
#define	SYSTEM	(*(volatile struct st_system __sfr __evenaccess *)0x80000)
#define	USB0	(*(volatile struct st_usb0   __sfr __evenaccess *)0xA0000)
#ifdef __IAR_SYSTEMS_ICC__
#pragma bitfields=default
#pragma language=restore
#else
#pragma bit_order
#endif

#ifndef __IAR_SYSTEMS_ICC__
#pragma packoption
#endif

#endif
